app/controllers/modulos_controller.rb

  def index
    @modulos = Modulo.all
---
SELECT "modulos".* FROM "modulos"

  def create
    @modulo = Modulo.new(modulo_params)

    respond_to do |format|
      if @modulo.save
---
INSERT INTO "modulos" ("name", "descripcion", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "administracion"], ["descripcion", "administracion"], ["created_at", "2016-02-22 23:57:58.367162"], ["updated_at", "2016-02-22 23:57:58.367162"]]

    def set_modulo
      @modulo = Modulo.find(params[:id])
---
SELECT  "modulos".* FROM "modulos" WHERE "modulos"."id" = ? LIMIT 1  [["id", 1]]