app/controllers/perfiles_controller.rb

  def index
    @perfiles = Perfile.all
---
SELECT "perfiles".* FROM "perfiles"

  def create
    @perfile = Perfile.new(perfile_params)

    respond_to do |format|
      if @perfile.save
---
INSERT INTO "perfiles" ("name", "nivel", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Super usuario"], ["nivel", "1"], ["created_at", "2016-02-22 23:47:18.887427"], ["updated_at", "2016-02-22 23:47:18.887427"]]

  def update
    respond_to do |format|
      if @perfile.update(perfile_params)
---
UPDATE "perfiles" SET "name" = ?, "updated_at" = ? WHERE "perfiles"."id" = ?  [["name", "Administrador"], ["updated_at", "2016-02-22 23:48:35.609688"], ["id", 1]]

    def set_perfile
      @perfile = Perfile.find(params[:id])
---
SELECT  "perfiles".* FROM "perfiles" WHERE "perfiles"."id" = ? LIMIT 1  [["id", 1]]