app/controllers/vehiculos_controller.rb

  def index
    @vehiculos = Vehiculo.all
---
SELECT "vehiculos".* FROM "vehiculos"

  def create
    @vehiculo = Vehiculo.new(vehiculo_params)

    respond_to do |format|
      if @vehiculo.save
---
INSERT INTO "vehiculos" ("marca", "modelo", "anio", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["marca", "AUDI"], ["modelo", "Q10"], ["anio", 2015], ["created_at", "2016-02-23 00:04:09.118907"], ["updated_at", "2016-02-23 00:04:09.118907"]]

    def set_vehiculo
      @vehiculo = Vehiculo.find(params[:id])
---
SELECT  "vehiculos".* FROM "vehiculos" WHERE "vehiculos"."id" = ? LIMIT 1  [["id", 1]]